; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 8062)
	(= (fuel plane1) 199)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 11)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at person1 city2)
	(at person2 city2)
	(at person3 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 850)
	(= (distance city0 city2) 904)
	(= (distance city1 city0) 850)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 544)
	(= (distance city2 city0) 904)
	(= (distance city2 city1) 544)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city2)
	(at person3 city1)
	))

(:metric minimize (+ (* 2 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (refuel plane1 city0)
   changed: (fuel plane1) from 199 to 8062
   goals met: 2 of 3
2. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 0 to 2712, (fuel plane1) from 8062 to 5350
   goals met: 2 of 3
3. (board person1 plane1 city2)
   deleted: (at person1 city2)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 3
4. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 2712 to 4344, (fuel plane1) from 5350 to 3718
   goals met: 2 of 3
5. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 3
